In [14]:
import sqlalchemy as db
import pandas as pd

###### Підключення до БД та створення метаданих

In [15]:
db_name = 'iowa_liqour_sales'
user = 'postgres'
password = 'postgres'

engine = db.create_engine(f'postgresql+psycopg2://{user}:{password}@localhost/{db_name}')
connection = engine.connect()
metadata = db.MetaData()

###### Ініціалізація потрібних таблиць

In [16]:
sale = db.Table('sale', metadata, autoload=True, autoload_with=engine)
store = db.Table('store', metadata, autoload=True, autoload_with=engine)
store_loc = db.Table('store_location', metadata, autoload=True, autoload_with=engine)
details = db.Table('details', metadata, autoload=True, autoload_with=engine)
description = db.Table('description', metadata, autoload=True, autoload_with=engine)

###### *1. Відсортувати кількість проданого алкоголю в літрах за містами:*  
###### SELECT city, (volume * quantity) AS total_volume
###### FROM store_location  
###### JOIN store USING(zip_code)  
###### JOIN sale USING(store_name)  
###### JOIN details USING(invoice)  
###### ORDER BY volume DESC

In [17]:
query = db.select([store_loc.c.city, (details.c.volume * details.c.quantity).label('total_volume')])
query = query.select_from(store_loc.join(store).join(sale).join(details)).order_by(db.desc(details.c.volume))
result_1 = pd.DataFrame(connection.execute(query).fetchall())
result_1

         city  total_volume
0      Lisbon         10500
1     Oakland          1500
2     Corning          1500
3     Wapello          1500
4  Clear Lake          1500

###### *2. Знайти опис тих товарів, ціни за одиницю яких, більші за середнє значення відповідного поля та вивести магазини в якому вони були продані:*
###### SELECT store_name, item_desc, retail
###### FROM sale
###### JOIN details USING(invoice)
###### JOIN description USING(item_num)
###### WHERE retail > (SELECT AVG(retail) FROM details)

In [18]:
query = db.select([sale.c.store_name, description.c.item_desc, details.c.retail])
query = query.select_from(sale.join(details).join(description)).where(details.c.retail > db.select([db.func.avg(details.c.retail)]).label('avg_retail'))
result_2 = pd.DataFrame(connection.execute(query).fetchall())
result_2

                    store_name                          item_desc retail
0     Brothers Market / Lisbon                Ryans Cream Liqueur  16.31
1  Hy-Vee Food Store / Corning  Dr. Mcgillicuddys Cherry Schnapps  12.99
2        Wapello Jack and Jill               Jagermeister Liqueur  18.06

###### *3. Відсортувати сумарні продажі за часом*  
###### SELECT (quantity * retail) AS total_retail, sale_date  
###### FROM sale  
###### JOIN details USING(invoice)  
###### ORDER BY sale_date

In [19]:
query = db.select([(details.c.quantity * details.c.retail).label('total_retail'), sale.c.sale_date])
query = query.select_from(sale.join(details)).order_by(db.asc(sale.c.sale_date))
result_3 = pd.DataFrame(connection.execute(query).fetchall())
result_3

  total_retail   sale_date
0        36.12  2012-11-07
1        97.86  2014-11-17
2        21.32  2015-02-19
3        18.90  2015-08-25
4        25.98  2017-07-14

In [20]:
results = [result_1, result_2, result_3]

###### Зберігаємо результати запитів в віртуальному середовищі

In [21]:
%store results

Stored 'results' (list)